{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "MobilenetV3small_input"}}, {"class_name": "Functional", "config": {"name": "MobilenetV3small", "trainable": false, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_6", "trainable": false, "dtype": "float32", "scale": 0.00784313725490196, "offset": -1.0}, "name": "rescaling_6", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv", "inbound_nodes": [[["rescaling_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv/BatchNorm", "inbound_nodes": [[["Conv", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_162", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_162", "inbound_nodes": [["Conv/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_192", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_192", "inbound_nodes": [[["tf.__operators__.add_162", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_162", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_162", "inbound_nodes": [["re_lu_192", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_108", "trainable": false, "dtype": "float32"}, "name": "multiply_108", "inbound_nodes": [[["Conv/BatchNorm", 0, 0, {}], ["tf.math.multiply_162", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv/depthwise/pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv/depthwise/pad", "inbound_nodes": [[["multiply_108", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv/depthwise", "inbound_nodes": [[["expanded_conv/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_193", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_193", "inbound_nodes": [[["expanded_conv/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_193", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_163", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_163", "inbound_nodes": [["expanded_conv/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_194", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_194", "inbound_nodes": [[["tf.__operators__.add_163", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_163", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_163", "inbound_nodes": [["re_lu_194", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv/squeeze_excite/Mul", "inbound_nodes": [[["re_lu_193", 0, 0, {}], ["tf.math.multiply_163", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/project", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/project", "inbound_nodes": [[["expanded_conv/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/project/BatchNorm", "inbound_nodes": [[["expanded_conv/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/expand", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/expand", "inbound_nodes": [[["expanded_conv/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_1/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_195", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_195", "inbound_nodes": [[["expanded_conv_1/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1/depthwise/pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_1/depthwise/pad", "inbound_nodes": [[["re_lu_195", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_1/depthwise", "inbound_nodes": [[["expanded_conv_1/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_1/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_196", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_196", "inbound_nodes": [[["expanded_conv_1/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/project", "inbound_nodes": [[["re_lu_196", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/project/BatchNorm", "inbound_nodes": [[["expanded_conv_1/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/expand", "trainable": false, "dtype": "float32", "filters": 88, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/expand", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_2/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_197", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_197", "inbound_nodes": [[["expanded_conv_2/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_2/depthwise", "inbound_nodes": [[["re_lu_197", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_2/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_198", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_198", "inbound_nodes": [[["expanded_conv_2/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/project", "inbound_nodes": [[["re_lu_198", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/project/BatchNorm", "inbound_nodes": [[["expanded_conv_2/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_2/Add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_2/Add", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}], ["expanded_conv_2/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/expand", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/expand", "inbound_nodes": [[["expanded_conv_2/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_3/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_164", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_164", "inbound_nodes": [["expanded_conv_3/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_199", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_199", "inbound_nodes": [[["tf.__operators__.add_164", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_164", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_164", "inbound_nodes": [["re_lu_199", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_109", "trainable": false, "dtype": "float32"}, "name": "multiply_109", "inbound_nodes": [[["expanded_conv_3/expand/BatchNorm", 0, 0, {}], ["tf.math.multiply_164", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3/depthwise/pad", "trainable": false, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "expanded_conv_3/depthwise/pad", "inbound_nodes": [[["multiply_109", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_3/depthwise", "inbound_nodes": [[["expanded_conv_3/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_3/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_165", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_165", "inbound_nodes": [["expanded_conv_3/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_200", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_200", "inbound_nodes": [[["tf.__operators__.add_165", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_165", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_165", "inbound_nodes": [["re_lu_200", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_110", "trainable": false, "dtype": "float32"}, "name": "multiply_110", "inbound_nodes": [[["expanded_conv_3/depthwise/BatchNorm", 0, 0, {}], ["tf.math.multiply_165", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_3/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_110", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_3/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_3/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_166", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_166", "inbound_nodes": [["expanded_conv_3/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_201", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_201", "inbound_nodes": [[["tf.__operators__.add_166", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_166", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_166", "inbound_nodes": [["re_lu_201", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_3/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_3/squeeze_excite/Mul", "inbound_nodes": [[["multiply_110", 0, 0, {}], ["tf.math.multiply_166", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/project", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/project/BatchNorm", "inbound_nodes": [[["expanded_conv_3/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/expand", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/expand", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_4/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_167", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_167", "inbound_nodes": [["expanded_conv_4/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_202", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_202", "inbound_nodes": [[["tf.__operators__.add_167", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_167", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_167", "inbound_nodes": [["re_lu_202", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_111", "trainable": false, "dtype": "float32"}, "name": "multiply_111", "inbound_nodes": [[["expanded_conv_4/expand/BatchNorm", 0, 0, {}], ["tf.math.multiply_167", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_4/depthwise", "inbound_nodes": [[["multiply_111", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_4/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_168", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_168", "inbound_nodes": [["expanded_conv_4/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_203", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_203", "inbound_nodes": [[["tf.__operators__.add_168", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_168", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_168", "inbound_nodes": [["re_lu_203", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_112", "trainable": false, "dtype": "float32"}, "name": "multiply_112", "inbound_nodes": [[["expanded_conv_4/depthwise/BatchNorm", 0, 0, {}], ["tf.math.multiply_168", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_4/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_112", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_4/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_4/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_169", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_169", "inbound_nodes": [["expanded_conv_4/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_204", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_204", "inbound_nodes": [[["tf.__operators__.add_169", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_169", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_169", "inbound_nodes": [["re_lu_204", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_4/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_4/squeeze_excite/Mul", "inbound_nodes": [[["multiply_112", 0, 0, {}], ["tf.math.multiply_169", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/project", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/project/BatchNorm", "inbound_nodes": [[["expanded_conv_4/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_4/Add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_4/Add", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}], ["expanded_conv_4/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/expand", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/expand", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_5/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_170", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_170", "inbound_nodes": [["expanded_conv_5/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_205", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_205", "inbound_nodes": [[["tf.__operators__.add_170", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_170", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_170", "inbound_nodes": [["re_lu_205", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_113", "trainable": false, "dtype": "float32"}, "name": "multiply_113", "inbound_nodes": [[["expanded_conv_5/expand/BatchNorm", 0, 0, {}], ["tf.math.multiply_170", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_5/depthwise", "inbound_nodes": [[["multiply_113", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_5/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_171", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_171", "inbound_nodes": [["expanded_conv_5/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_206", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_206", "inbound_nodes": [[["tf.__operators__.add_171", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_171", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_171", "inbound_nodes": [["re_lu_206", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_114", "trainable": false, "dtype": "float32"}, "name": "multiply_114", "inbound_nodes": [[["expanded_conv_5/depthwise/BatchNorm", 0, 0, {}], ["tf.math.multiply_171", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_5/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_5/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_114", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_5/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_5/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_172", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_172", "inbound_nodes": [["expanded_conv_5/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_207", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_207", "inbound_nodes": [[["tf.__operators__.add_172", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_172", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_172", "inbound_nodes": [["re_lu_207", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_5/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_5/squeeze_excite/Mul", "inbound_nodes": [[["multiply_114", 0, 0, {}], ["tf.math.multiply_172", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/project", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/project/BatchNorm", "inbound_nodes": [[["expanded_conv_5/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_5/Add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_5/Add", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}], ["expanded_conv_5/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6/expand", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6/expand", "inbound_nodes": [[["expanded_conv_5/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_6/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_6/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_6/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_173", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_173", "inbound_nodes": [["expanded_conv_6/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_208", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_208", "inbound_nodes": [[["tf.__operators__.add_173", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_173", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_173", "inbound_nodes": [["re_lu_208", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_115", "trainable": false, "dtype": "float32"}, "name": "multiply_115", "inbound_nodes": [[["expanded_conv_6/expand/BatchNorm", 0, 0, {}], ["tf.math.multiply_173", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_6/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, 